In [2]:
import pandas as pd

In [13]:
# DataFrame 
# info = {
#     "Name" : ["Rahul","Aayush","Pandey"],
#     "CGPA" :[7.5,7.2,9.4]
# }

# df = pd.DataFrame(info)
# df
# print(df)

In [16]:
#Series
s = pd.Series([1,2,3,4,5,6])
# s
# print(s,type(s))

# index
print(s[2])

3

In [28]:
s = pd.Series([23,28,32,45],index=["adam","eve","bod","charlie"])
print(s)

print(s["eve"])
# print(s[1])
# FutureWarning: Series.__getitem__ treating keys as positions is deprecated.
# In a future version, integer keys will always be treated as labels

adam       23
eve        28
bod        32
charlie    45
dtype: int64
28

In [ ]:
s1 = pd.Series([])

In [31]:
#CSV Data
df1 = pd.read_csv("employee_data.csv")

print(df1,type(df1))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [44]:
#Json

df2 = pd.read_json("employedata.json")
print(df2)

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [42]:
df2.head() #Starting 5 rows
df2.tail() #last 5 rows df2.tail(2) last two or any n rows
df2.sample() #random row

   ID     Name  Age Department  Salary
2   3  Charlie   28    Finance   48000

In [45]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

In [49]:
# df2.shape

df2.describe()

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  64500.000000
std     3.02765   6.674162  15182.226451
min     1.00000  25.000000  47000.000000
25%     3.25000  28.250000  51250.000000
50%     5.50000  31.000000  62500.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000